Revit 2027 API
ParameterTypeId.MepWaterloopType Property
 "Loop Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MepWaterloopType { get; }
Public Shared ReadOnly Property MepWaterloopType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MepWaterloopType {
	ForgeTypeId^ get ();
}
static member MepWaterloopType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace